In [1]:
import pandas as pd

In [2]:
bios=pd.read_csv('./data/bios.csv')

In [3]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [4]:
bios.loc[
    (bios['height_cm']>200)&
    (bios['born_country']=='FRA')&
    (bios['born_city']=='Paris'),
    :
    ].sort_values(['height_cm','born_date'],ascending=[1,0])

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
122605,124711,Yakhouba Diawara,1982-08-29,Paris,Paris,FRA,France,201.0,102.0,NaN
131168,133932,Nicolas Le Goff,1992-02-15,Paris,Paris,FRA,France,206.0,115.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [5]:
bios.loc[
    bios['name'].str.contains('Keith')
]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [6]:
coffee=pd.read_csv('./warmup-data/coffee.csv')

In [7]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [8]:
coffee['Price']=100

In [9]:
coffee.head()

         Day Coffee Type  Units Sold  Price
0     Monday    Espresso          25    100
1     Monday       Latte          15    100
2    Tuesday    Espresso          30    100
3    Tuesday       Latte          20    100
4  Wednesday    Espresso          35    100

In [10]:
import numpy as np
coffee['New_Price']=np.where(coffee['Coffee Type']=='Espresso',150,100)

In [11]:
coffee.head()

         Day Coffee Type  Units Sold  Price  New_Price
0     Monday    Espresso          25    100        150
1     Monday       Latte          15    100        100
2    Tuesday    Espresso          30    100        150
3    Tuesday       Latte          20    100        100
4  Wednesday    Espresso          35    100        150

In [12]:
coffee.drop(columns=['Price'], inplace=True)

In [13]:
coffee.head()

         Day Coffee Type  Units Sold  New_Price
0     Monday    Espresso          25        150
1     Monday       Latte          15        100
2    Tuesday    Espresso          30        150
3    Tuesday       Latte          20        100
4  Wednesday    Espresso          35        150

In [14]:
coffee.drop(0, inplace=True)

In [15]:
coffee.head()

         Day Coffee Type  Units Sold  New_Price
1     Monday       Latte          15        100
2    Tuesday    Espresso          30        150
3    Tuesday       Latte          20        100
4  Wednesday    Espresso          35        150
5  Wednesday       Latte          25        100

In [16]:
coffee.loc[0]=['Monday','Espresso','30','150']

In [17]:
coffee.sort_index(inplace=True)

In [18]:
coffee.head()

         Day Coffee Type Units Sold New_Price
0     Monday    Espresso         30       150
1     Monday       Latte         15       100
2    Tuesday    Espresso         30       150
3    Tuesday       Latte         20       100
4  Wednesday    Espresso         35       150

In [19]:
coffee.rename(columns={'New_Price':'Price'})

          Day Coffee Type Units Sold Price
0      Monday    Espresso         30   150
1      Monday       Latte         15   100
2     Tuesday    Espresso         30   150
3     Tuesday       Latte         20   100
4   Wednesday    Espresso         35   150
5   Wednesday       Latte         25   100
6    Thursday    Espresso         40   150
7    Thursday       Latte         30   100
8      Friday    Espresso         45   150
9      Friday       Latte         35   100
10   Saturday    Espresso         45   150
11   Saturday       Latte         35   100
12     Sunday    Espresso         45   150
13     Sunday       Latte         35   100

In [20]:
coffee.head()

         Day Coffee Type Units Sold New_Price
0     Monday    Espresso         30       150
1     Monday       Latte         15       100
2    Tuesday    Espresso         30       150
3    Tuesday       Latte         20       100
4  Wednesday    Espresso         35       150

In [21]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [22]:
bios_new=bios.copy()

In [23]:
bios_new['first name']=(bios_new['name'].str.split(' ').str[0])

In [25]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [26]:
bios_new.loc[bios_new['first name']=="Keith"]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [28]:
bios_new['born_datetime']=pd.to_datetime(bios_new['born_date']).dt.year.astype('Int64')

In [29]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first name,born_datetime
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878

In [30]:
bios_new.info()

<class 'pandas.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  str
 2   born_date      143693 non-null  str
 3   born_city      110908 non-null  str
 4   born_region    110908 non-null  str
 5   born_country   110908 non-null  str
 6   NOC            145499 non-null  str
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   str
 10  first name     145500 non-null  object
 11  born_datetime  143693 non-null  Int64
dtypes: Int64(1), float64(2), int64(1), object(1), str(7)
memory usage: 20.9+ MB